uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_FLASH.h
/***********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher
    
    ---------------------------------------------------------------------
    File:      kinetis_FLASH.h
    Project:   Single Chip Embedded Internet
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2016
    *********************************************************************
    12.01.2015 Perform write enable for SPI_FLASH_S25FL1_K (for KL/KE driver compatibility) {1}

*/


/* =================================================================== */
/*                          local definitions                          */
/* =================================================================== */

#if !defined SIZE_OF_NVRAM
    #define SIZE_OF_NVRAM 0
#endif

#if defined SPI_SW_UPLOAD || defined SPI_FLASH_FAT || (defined SPI_FILE_SYSTEM && defined FLASH_FILE_SYSTEM)
    #define SPI_FLASH_ENABLED 
#endif

/* =================================================================== */
/*                             constants                               */
/* =================================================================== */

/* =================================================================== */
/*                     global variable definitions                     */
/* =================================================================== */

#if (defined FLASH_ROUTINES || defined ACTIVE_FILE_SYSTEM  || defined USE_PARAMETER_BLOCK || defined INTERNAL_USER_FILES) && defined _WINDOWS
    extern int iFetchingInternalMemory = _ACCESS_NOT_IN_CODE;
#endif



#if defined FLASH_ROUTINES || defined FLASH_FILE_SYSTEM || defined USE_PARAMETER_BLOCK || defined SUPPORT_PROGRAM_ONCE
// This routine runs from SRAM - the reason why the pointer is passed is to avoid the routine taking it from a const value in FLASH, which is then not code location independent
//
    #if defined _WINDOWS
        #if defined USE_SECTION_PROGRAMMING                              // {105}
            static unsigned char ucFlexRam[FLEXRAM_SIZE] = {0};
            #undef FLEXRAM_START_ADDRESS
            #define FLEXRAM_START_ADDRESS  ucFlexRam
        #endif
static void fnFlashRoutine(volatile unsigned char *ptrFTFL_BLOCK)
{
    *ptrFTFL_BLOCK = FTFL_STAT_CCIF;                                     // launch the command - this clears the FTFL_STAT_CCIF flag (register is FTFL_FSTAT)
    while ((*ptrFTFL_BLOCK & FTFL_STAT_CCIF) == 0) {}                    // wait for the command to terminate
}
    #else                                                                // {46}
static unsigned short fnFlashRoutine[] = {                               // to avoid potential compiler in-lining of the routine (removing position independency) the machine code is used directly
    0x2180,    // MOVS   r1,#0x80                                           load the value 0x80 (command complete interrupt flag) to register r1
    0x7001,    // STRB   r1,[r0,#0x00]                                      write r1 (0x80) to the passed pointer location (r0)
    0x7801,    // LDRB   r1,[r0,#0x00]                                      read back from the same location to r1
    0x0609,    // LSLS   r1,r1,#24                                          shift the register content by 24 bits to the left so that the command complete interrupt flag is at bit 31
    0xd5fc,    // BPL    -4                                                 if the command complete interrupt flag bit is '0' (register content is not negative value) branch back to read its value again
    0x4770     // BX     lr                                                 return from sub-routine
};
    #endif


static int fnFlashNow(unsigned char ucCommand, unsigned long *ptrWord, unsigned long *ptr_ulWord)
{
    static void (*fnRAM_code)(volatile unsigned char *) = 0;
    #if defined FLEXFLASH_DATA || (defined KINETIS_KE && (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)) // {82}{109}
    int iNoInterruptDisable = 0;                                         // the default is to protect programming from interrupts
    #endif
    if (fnRAM_code == 0) {                                               // the first time this is used it will load the program to SRAM
        #define PROG_WORD_SIZE 30                                        // adequate space for the small program
        int i = 0;
        unsigned char *ptrThumb2 = (unsigned char *)fnFlashRoutine;
        static unsigned short usProgSpace[PROG_WORD_SIZE] = {0};         // make space for the routine on stack (this will have an even boundary)

        ptrThumb2 =  (unsigned char *)(((CAST_POINTER_ARITHMETIC)ptrThumb2) & ~0x1); // thumb 2 address
        while (i < PROG_WORD_SIZE) {                                     // copy program to SRAM
            usProgSpace[i++] = *(unsigned short *)ptrThumb2;
            ptrThumb2 += sizeof (unsigned short);
        }
        ptrThumb2 = (unsigned char *)usProgSpace;
        ptrThumb2++;                                                     // create a thumb 2 call
        fnRAM_code = (void(*)(volatile unsigned char *))(ptrThumb2);
    #if defined KINETIS_KE                                               // set the flash programming clock to 1MHz once after a reset
        #if BUS_CLOCK < 8000000
        _EXCEPTION("Bus clock must be at least 800kHz to program flash!");
        #elif BUS_CLOCK <= 1600000                                       // recommended values depending on bus clock
        FTMRH_FCLKDIV = 0x00;
        #elif BUS_CLOCK <= 2600000
        FTMRH_FCLKDIV = 0x01
        #elif BUS_CLOCK <= 3600000
        FTMRH_FCLKDIV = 0x02;
        #elif BUS_CLOCK <= 4600000
        FTMRH_FCLKDIV = 0x03;
        #elif BUS_CLOCK <= 5600000
        FTMRH_FCLKDIV = 0x04;
        #elif BUS_CLOCK <= 6600000
        FTMRH_FCLKDIV = 0x05;
        #elif BUS_CLOCK <= 7600000
        FTMRH_FCLKDIV = 0x06;
        #elif BUS_CLOCK <= 8600000
        FTMRH_FCLKDIV = 0x07;
        #elif BUS_CLOCK <= 9600000
        FTMRH_FCLKDIV = 0x08;
        #elif BUS_CLOCK <= 10600000
        FTMRH_FCLKDIV = 0x09;
        #elif BUS_CLOCK <= 11600000
        FTMRH_FCLKDIV = 0x0a;
        #elif BUS_CLOCK <= 12600000
        FTMRH_FCLKDIV = 0x0b;
        #elif BUS_CLOCK <= 13600000
        FTMRH_FCLKDIV = 0x0c;
        #elif BUS_CLOCK <= 14600000
        FTMRH_FCLKDIV = 0x0d;
        #elif BUS_CLOCK <= 15600000
        FTMRH_FCLKDIV = 0x0e;
        #elif BUS_CLOCK <= 16600000
        FTMRH_FCLKDIV = 0x0f;
        #elif BUS_CLOCK <= 17600000
        FTMRH_FCLKDIV = 0x10;
        #elif BUS_CLOCK <= 18600000
        FTMRH_FCLKDIV = 0x11;
        #elif BUS_CLOCK <= 19600000
        FTMRH_FCLKDIV = 0x12;
        #elif BUS_CLOCK <= 20600000
        FTMRH_FCLKDIV = 0x13;
        #elif BUS_CLOCK <= 21600000
        FTMRH_FCLKDIV = 0x14;
        #elif BUS_CLOCK <= 22600000
        FTMRH_FCLKDIV = 0x15;
        #elif BUS_CLOCK <= 23600000
        FTMRH_FCLKDIV = 0x16;
        #elif BUS_CLOCK <= 24600000
        FTMRH_FCLKDIV = 0x17;
        #else
        FTMRH_FCLKDIV = 0x18;
        #endif
    #endif
    }
    while ((FTFL_FSTAT & FTFL_STAT_CCIF) == 0) {}                        // wait for previous commands to complete

