uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_FLASH.h
    #if defined FTFL_STAT_RDCOLERR
    if ((FTFL_FSTAT & (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL | FTFL_STAT_RDCOLERR)) != 0) { // check for errors in previous command 
        FTFL_FSTAT = (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL | FTFL_STAT_RDCOLERR); // clear old errors
    }
    #else
    if ((FTFL_FSTAT & (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL)) != 0) {     // check for errors in previous command 
        FTFL_FSTAT = (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL);              // clear old errors
    }
    #endif

    #if defined KINETIS_KE
    FTMRH_FCCOBIX = 0;                                                   // reset the command index
        #if (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)               // {109}
    if (ptrWord >= (unsigned long *)(SIZE_OF_FLASH - SIZE_OF_EEPROM)) {  // is the access a write/erase in EEPROM
        ptrWord += ((KE_EEPROM_START_ADDRESS - (SIZE_OF_FLASH - SIZE_OF_EEPROM))/sizeof(unsigned long)); // convert to EEPROM physical address
        if (FCMD_ERASE_FLASH_SECTOR == ucCommand) {
            ucCommand = FCMD_ERASE_EEPROM_SECTOR;                        // modify the command to the EEPROM sector erase command
        }
        iNoInterruptDisable = 1;                                         // this command may execute without interrupts being disabled
    }
        #endif
    #endif

    switch (FTFL_FCCOB0 = ucCommand) {                                   // enter the command sequence
    case FCMD_ERASE_ALL_BLOCKS:                                          // single command word required with the erase all blocks command
    #if defined _WINDOWS
        {
            unsigned char *ptrFlash = 0;
            do {
                fnDeleteFlashSector(fnGetFlashAdd(ptrFlash));            // erase all sectors
                ptrFlash += FLASH_GRANULARITY;
            } while (ptrFlash < (unsigned char *)SIZE_OF_FLASH);
        }
    #endif
        break;
    #if defined USE_SECTION_PROGRAMMING                                  // {105}
    case FCMD_PROGRAM_SECTOR:
    #endif
    #if (defined KINETIS_KE && (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)) // {109}
    case FCMD_PROGRAM_EEPROM:
    case FCMD_ERASE_EEPROM_SECTOR:
    #endif
    case FCMD_ERASE_FLASH_SECTOR:
    case FCMD_PROGRAM:
    #if defined FLEXFLASH_DATA                                           // {82} if working with FlashNMV in data flash mode
        if (ptrWord >= (unsigned long *)(SIZE_OF_FLASH - SIZE_OF_FLEXFLASH)) { // is the access a write/erase in FlexNVM
            ptrWord += ((FLEXNVM_START_ADDRESS - (SIZE_OF_FLASH - SIZE_OF_FLEXFLASH))/sizeof(unsigned long)); // convert to FlexNVM physical address
        }
    #endif
    #if defined SUPPORT_SWAP_BLOCK
    case FCMD_SWAP:
    #endif
        FTFL_FCCOB1 = (unsigned char)(((CAST_POINTER_ARITHMETIC)ptrWord) >> 16); // set address in flash
    #if defined FLEXFLASH_DATA                                           // {82} if working with FlashNMV in data flash mode
        if ((CAST_POINTER_ARITHMETIC)ptrWord & FLEXNVM_START_ADDRESS) {
            FTFL_FCCOB1 |= 0x80;                                         // set address A23 so that the write/erase is in FlexNVM
            iNoInterruptDisable = 1;                                     // this command may execute without interrupts being disabled
        }
    #endif
    #if defined KINETIS_KE
        FTMRH_FCCOBIX = 1;                                               // set the command index
    #endif
        FTFL_FCCOB2 = (unsigned char)(((CAST_POINTER_ARITHMETIC)ptrWord) >> 8);
        FTFL_FCCOB3 = (unsigned char)((CAST_POINTER_ARITHMETIC)ptrWord);
        if (FCMD_PROGRAM == ucCommand) {                                 // program long-word aligned value
    #if defined KINETIS_KE
            FTMRH_FCCOBIX = 2;                                           // set the command index
            FTMRH_FCCOBHI = (unsigned char)(*ptr_ulWord >> 8);
            FTMRH_FCCOBLO = (unsigned char)(*ptr_ulWord);
            FTMRH_FCCOBIX = 3;                                           // set the command index
            FTMRH_FCCOBHI = (unsigned char)(*ptr_ulWord >> 24);
            FTMRH_FCCOBLO = (unsigned char)(*ptr_ulWord >> 16);
    #else
            FTFL_FCCOB7_4 = *ptr_ulWord;                                 // enter the long word to be programmed
    #endif
    #if defined _WINDOWS
          if (*(unsigned long *)fnGetFlashAdd((unsigned char *)ptrWord) != 0xffffffff) { // {36}
                _EXCEPTION("Attempting to write to non-blank flash unit!!");
            }
            *(unsigned long *)fnGetFlashAdd((unsigned char *)ptrWord) = *ptr_ulWord;
    #endif
    #if (FLASH_ROW_SIZE == 8)                                            // {10} write second long word
            ptr_ulWord++;
        #if defined KINETIS_KE
            FTMRH_FCCOBIX = 4;                                           // set the command index
            FTMRH_FCCOBHI = (unsigned char)(*ptr_ulWord >> 8);
            FTMRH_FCCOBLO = (unsigned char)(*ptr_ulWord);
            FTMRH_FCCOBIX = 5;                                           // set the command index
            FTMRH_FCCOBHI = (unsigned char)(*ptr_ulWord >> 24);
            FTMRH_FCCOBLO = (unsigned char)(*ptr_ulWord >> 16);
        #else
            FTFL_FCCOBB_8 = *ptr_ulWord;                                 // enter the second long word to be programmed
        #endif
        #if defined _WINDOWS                                             // {31}
            if (*(unsigned long *)fnGetFlashAdd((unsigned char *)(ptrWord + 1)) != 0xffffffff) { // {36}
                _EXCEPTION("Attempting to write to non-blank flash unit!!");
            }
            *(unsigned long *)fnGetFlashAdd((unsigned char *)(ptrWord + 1)) = *ptr_ulWord;;
        #endif
    #endif
        }
    #if (defined KINETIS_KE && (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)) // {109}
        else if (FCMD_PROGRAM_EEPROM == ucCommand) {                     // if programming to EEPROM write a single byte
            FTMRH_FCCOBIX = 2;                                           // set the command index
            FTMRH_FCCOBLO = *(unsigned char *)ptr_ulWord;
        #if defined _WINDOWS
            if (*(unsigned char *)fnGetFlashAdd((unsigned char *)ptrWord) != 0xff) {
                _EXCEPTION("Attempting to write to non-blank EEPROM byte!!");
            }
            *(unsigned char *)fnGetFlashAdd((unsigned char *)ptrWord) = *(unsigned char *)ptr_ulWord;
        #endif
            break;
        }
    #endif
    #if defined USE_SECTION_PROGRAMMING                                  // {105}
        else if (ucCommand == FCMD_PROGRAM_SECTOR) {
            FTFL_FCCOB4 = (unsigned char)(*ptr_ulWord >> 8);             // enter the number of long words/phrases to be programmed
            FTFL_FCCOB5 = (unsigned char)(*ptr_ulWord);
        #if defined _WINDOWS
            {
                unsigned long ulProgrammingCycles = ((FTFL_FCCOB4 << 8) | FTFL_FCCOB5);
                unsigned long ulStartAddress = (FTFL_FCCOB1 << 16);
                ulStartAddress |= (FTFL_FCCOB2 << 8);
                ulStartAddress |= (FTFL_FCCOB3);
                ulProgrammingCycles *= FLASH_ROW_SIZE;                   // number of bytes to be programmed
                if (ulProgrammingCycles > FLEXRAM_MAX_SECTION_COPY_SIZE) {
                    _EXCEPTION("Sector write size is too long");
                }
                memcpy(fnGetFlashAdd((unsigned char *)ulStartAddress), (void *)FLEXRAM_START_ADDRESS, ulProgrammingCycles);
            }
        #endif
        }
    #endif
    #if defined SUPPORT_SWAP_BLOCK
        else if (FCMD_SWAP == ucCommand) {
            FTFL_FCCOB7_4 = *ptr_ulWord;
        }
    #endif
        else {
    #if defined _WINDOWS
            fnDeleteFlashSector(fnGetFlashAdd((unsigned char *)ptrWord));// the sector erase must be phrase aligned ([2:0] = 0)
    #endif
        }
        break;
    #if defined SUPPORT_PROGRAM_ONCE                                     // {20}
    case FCMD_READ_ONCE:
        FTFL_FCCOB1 = (unsigned char)(*ptrWord);                         // record index (0..7) for FPU types or (0..15)
        #if defined _WINDOWS
        {
            unsigned char *ptrFlash = fnGetFileSystemStart(0);
            ptrFlash += SIZE_OF_FLASH + ((unsigned char)FTFL_FCCOB1 * FLASH_ROW_SIZE); // move to the location containg this value in simulated flash
            FTFL_FCCOB4 = *ptrFlash++;                                   // load the result registers with the content
            FTFL_FCCOB5 = *ptrFlash++;
            FTFL_FCCOB6 = *ptrFlash++;
            FTFL_FCCOB7 = *ptrFlash++;
            #if (FLASH_ROW_SIZE == 8)
            FTFL_FCCOB8 = *ptrFlash++;
            FTFL_FCCOB9 = *ptrFlash++;
            FTFL_FCCOBA = *ptrFlash++;
            FTFL_FCCOBB = *ptrFlash;
            #endif
        }
        #endif
        break;
    case FCMD_PROGRAM_ONCE:
        FTFL_FCCOB1 = (unsigned char)(*ptrWord);                         // record index (0..7) for FPU types or (0..15)
        FTFL_FCCOB7_4 = *ptr_ulWord;
        #if (FLASH_ROW_SIZE == 8)
        ptr_ulWord++;
        FTFL_FCCOBB_8 = *ptr_ulWord;
        #endif
        #if defined _WINDOWS
        {
            unsigned char cBlank[8] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
            unsigned char *ptrFlash = fnGetFileSystemStart(0);
            ptrFlash += SIZE_OF_FLASH + ((unsigned char)FTFL_FCCOB1 * FLASH_ROW_SIZE);// move to the location containing this value in simulated flash
            if (uMemcmp(ptrFlash, cBlank, FLASH_ROW_SIZE) == 0) {        // if not yet programmed
                *ptrFlash++ = FTFL_FCCOB4;                               // program the content - this can only be done once
                *ptrFlash++ = FTFL_FCCOB5;
                *ptrFlash++ = FTFL_FCCOB6;
                *ptrFlash++ = FTFL_FCCOB7;
            #if (FLASH_ROW_SIZE == 8)
                *ptrFlash++ = FTFL_FCCOB8;
                *ptrFlash++ = FTFL_FCCOB9;
                *ptrFlash++ = FTFL_FCCOBA;
                *ptrFlash   = FTFL_FCCOBB;
            #endif
            }
            else {
                _EXCEPTION("OTP location already programmed and can not be modified!!!");
                return FTFL_STAT_FPVIOL;                                 // signal programming error
            }
        }
        #endif
        break;
    #endif
    }
    #if defined FLEXFLASH_DATA || (defined KINETIS_KE && (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)) // {82}{109} if working with FlashNMV in data flash mode or EEPROM
    if (iNoInterruptDisable == 0) {
        uDisable_Interrupt();                                            // protect this region from interrupts
    }
    #else
    uDisable_Interrupt();                                                // protect this region from interrupts
    #endif
    #if defined _WINDOWS
    fnFlashRoutine((volatile unsigned char *)FLASH_STATUS_REGISTER);
    #else
    fnRAM_code((volatile unsigned char *)FLASH_STATUS_REGISTER);         // execute the command from SRAM
    #endif
    #if defined FLEXFLASH_DATA || (defined KINETIS_KE && (defined SIZE_OF_EEPROM && SIZE_OF_EEPROM > 0)) // {82}{109} if working with FlashNMV in data flash mode or EEPROM
    if (iNoInterruptDisable == 0) {
        uEnable_Interrupt();                                             // safe to accept interrupts again
    }
    #else
    uEnable_Interrupt();                                                 // safe to accept interrupts again
    #endif

    #if defined SUPPORT_PROGRAM_ONCE                                     // {20}
    if (FCMD_READ_ONCE == ucCommand) {                                   // the result (8 bytes) is in FTFL_FCCOB2/FTFL_FCCOB3
        *ptr_ulWord++ = ((FTFL_FCCOB4 << 24) | (FTFL_FCCOB5 << 16) | (FTFL_FCCOB6 << 8) | FTFL_FCCOB7);
        #if (FLASH_ROW_SIZE == 8)
        *ptr_ulWord   = ((FTFL_FCCOB8 << 24) | (FTFL_FCCOB9 << 16) | (FTFL_FCCOBA << 8) | FTFL_FCCOBB);
        #endif
    }
    #endif
    #if defined SUPPORT_SWAP_BLOCK
    if (FCMD_SWAP == ucCommand) {
        #if defined _WINDOWS
        switch (FTFL_FCCOB4) {
        case SWAP_CONTROL_CODE_REPORT_SWAP_STATUS:
            FTFL_FCCOB5 = CURRENT_SWAP_MODE_UNINITIALISED;               // initial state is usually uninitialised (except when previous operation was interrupted)
            break;
        case SWAP_CONTROL_CODE_INITIALISE_SWAP_SYSTEM:
            {
                unsigned char *ptrFlash = fnGetFileSystemStart(0);
                unsigned long ulOffset = ((FTFL_FCCOB1 << 16) | (FTFL_FCCOB2 << 8) | FTFL_FCCOB3);
                ptrFlash += ulOffset;
                if (*ptrFlash != 0xff) {
                    _EXCEPTION("Swap indicator not in erased state!!");
                }
                *ptrFlash = 0;
                FTFL_FCCOB5 = CURRENT_SWAP_MODE_READY;
            }
            break;
        }
        #endif
        *ptr_ulWord = FTFL_FCCOB7_4;                                     // update with the result
    }
    #endif
    return (FTFL_FSTAT & (FTFL_STAT_ACCERR | FTFL_STAT_FPVIOL | FTFL_STAT_MGSTAT0)); // if there was an error this will be non-zero
}
#endif

