uTasker/uTasker-Kinetis/Hardware/Kinetis/kinetis_FLASH.h
#if (FLASH_ROW_SIZE == 8)                                                // {10}
    #define PARAMETER_STATUS_SIZE   4                                    // status is 8 bytes long to match the  phrase programming requirement of these parts
#else
    #define PARAMETER_STATUS_SIZE   2                                    // status is 4 bytes long to match the long word programming requirement of these parts
#endif

// Kinetis has 2k (4k for FPU parts) byte blocks in program Flash which can be individually modified so we use one of these, and a backup if desired
// Kinetis KL has 1k byte blocks
//
extern unsigned char fnGetValidPars(unsigned char ucValid)
{
    unsigned long ulValidUse[PARAMETER_STATUS_SIZE];
    unsigned long ulCompare;

    fnGetParsFile((unsigned char *)PARAMETER_BLOCK_1, (unsigned char *)ulValidUse, sizeof(ulValidUse)); // the first 2 long word locations (4 with fast devices) define the validity of the block. 0x55555555 0x55555555 means it is fully valid. 0x55555555 0xffffffff means it contains temporary unvalidated data

    if (PRESENT_TEMP_BLOCK != ucValid) {
        ulCompare = 0x55555555;                                          // we are looking for validated pattern
    }
    else {
        ulCompare = 0xffffffff;                                          // we are looking for temporary pattern
    }

    if ((ulValidUse[0] == 0x55555555) && (ulValidUse[PARAMETER_STATUS_SIZE/2] == ulCompare)) {
        return 1;                                                        // first block matched request
    }
    #if defined USE_PAR_SWAP_BLOCK
    else {
        fnGetParsFile((unsigned char *)PARAMETER_BLOCK_2, (unsigned char *)ulValidUse, sizeof(ulValidUse));
        if ((ulValidUse[0] == 0x55555555) && (ulValidUse[PARAMETER_STATUS_SIZE/2] == ulCompare)) {
            return 2;                                                    // second block matched request
        }
    }
    #endif
    return 0;                                                            // all other cases indicate the searched block doesn't exist
}

// Retrieve parameter from the defined block
//
extern int fnGetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned long *ptrPar = PARAMETER_BLOCK_1;
    #if defined USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar += (PARAMETER_BLOCK_2 - PARAMETER_BLOCK_1);
    }
    #endif

    ptrPar += PARAMETER_STATUS_SIZE;                                     // first parameter starts after validation information
    #if defined PARAMETER_NO_ALIGNMENT                                   // {35}
    ptrPar = (unsigned long *)((unsigned char *)ptrPar + usParameterReference); // move to the location of the parameter using a pointer to bytes
    fnGetParsFile((unsigned char *)ptrPar, ucValue, usLength);
    #else
    ptrPar += usParameterReference;                                      // move to the long word location where the parameter value is stored
        #if (FLASH_ROW_SIZE == 8)
    ptrPar += usParameterReference;                                      // {10} move to double-long word location
        #endif

    while (usLength--) {
        fnGetParsFile((unsigned char *)ptrPar, ucValue++, 1);
        ptrPar += (PARAMETER_STATUS_SIZE/2);
    }
    #endif
    return 0;
}


// Delete all sectors contained in a parameter block
//
static int fnDeleteParBlock(unsigned char *ptrAddInPar)
{
    return (fnEraseFlashSector(ptrAddInPar, PARAMETER_BLOCK_SIZE));
}


// Write parameters to the defined block
//
extern int fnSetParameters(unsigned char ucValidBlock, unsigned short usParameterReference, unsigned char *ucValue, unsigned short usLength)
{
    unsigned long *ptrPar = PARAMETER_BLOCK_1, *ptrStart;
    unsigned long ulValid = 0x55555555;
    int iBlockUse = 0;
    unsigned long ulValidCheck[PARAMETER_STATUS_SIZE/2];

    if (TEMP_PARS & ucValidBlock) {
        ucValidBlock &= ~TEMP_PARS;
        iBlockUse = 1;
    }

    if (ucValidBlock & BLOCK_INVALID) {                                  // no valid parameter blocks have been found so we can use the first for saving the data.
        fnDeleteParBlock((unsigned char *)PARAMETER_BLOCK_1);            // we delete it to be sure it is fresh
    #if defined USE_PAR_SWAP_BLOCK
        fnDeleteParBlock((unsigned char *)PARAMETER_BLOCK_2);
    #endif
        ucValidBlock = 1;
    }

    #if defined USE_PAR_SWAP_BLOCK
    if (ucValidBlock == 2) {
        ptrPar = PARAMETER_BLOCK_2;
    }
    #endif
    ptrStart = ptrPar;
    ptrPar += PARAMETER_STATUS_SIZE;                                     // first parameter starts after validation information
    #if defined PARAMETER_NO_ALIGNMENT                                   // {35}
    ptrPar = (unsigned long *)((unsigned char *)ptrPar + usParameterReference); // move to the location of the parameter using a pointer to bytes
    #else
    ptrPar += usParameterReference;                                      // move to the long word location where the parameter value is stored
        #if (FLASH_ROW_SIZE == 8)
    ptrPar += usParameterReference;                                      // {10} move to double-long word (phrase) location
        #endif
    #endif

    if (usLength == 0) {                                                 // command rather than normal write
        if (iBlockUse != 0) {                                            // if we have a new set waiting, set it to use state
            iBlockUse = 0;
    #if defined USE_PAR_SWAP_BLOCK
            if (ptrStart == PARAMETER_BLOCK_1) {
                ptrPar = PARAMETER_BLOCK_2;
            }
            else {
                ptrPar = PARAMETER_BLOCK_1;
            }
            fnDeleteParBlock((unsigned char *)ptrPar);
    #endif
        }
        else {                                                           // we must delete the block
            fnDeleteParBlock((unsigned char *)ptrStart);
            if (usParameterReference != 0) {
                return 0;                                                // we don't validate it again
            }
        }
    }
    else {
    #if defined PARAMETER_NO_ALIGNMENT                                   // {35}
        #if defined _WINDOWS                                             // when simulating the write size to internal flash is checked since each write is expected to be a multiple of the flash write size
        if (ptrPar < (unsigned long *)SIZE_OF_FLASH) {                   // parameter memory is in the internal flash
            if ((usLength % FLASH_ROW_SIZE) != 0) {                      // check write block size which must always be a multiple of the flash write size
                _EXCEPTION("When using the option PARAMETER_NO_ALIGNMENT all parameter block writes must be of the correct modularity size");
            }
            if (((CAST_POINTER_ARITHMETIC)ptrPar & (FLASH_ROW_SIZE - 1)) != 0) { // check the alignment of the write
                _EXCEPTION("When using the option PARAMETER_NO_ALIGNMENT all parameter block writes must be aligned to a flash long word/phrase");
            }
        }
        #endif
        fnWriteBytesFlash((unsigned char *)ptrPar, ucValue, usLength);   // it is expected that the user writes blocks of parameter data that is aligned and packed to respect the characteristics of the flash memory being used
    #else
        #if (FLASH_ROW_SIZE == 8)                                        // {10}
        ulValidCheck[1] = 0xffffffff;
        #endif
        while (usLength--) {
        #if defined _WINDOWS || defined _LITTLE_ENDIAN
            ulValidCheck[0] = (0xffffff00 | *ucValue++);
        #else
            ulValidCheck[0] = (0x00ffffff | (*ucValue++ << 24));
        #endif
            fnWriteBytesFlash((unsigned char *)ptrPar, (unsigned char *)&ulValidCheck[0], sizeof(ulValidCheck)); // write each parameter to FLASH (each byte occupies a long word - 2 long words for fast parts)
            ptrPar += (PARAMETER_STATUS_SIZE/2);
        }
    #endif
    }
    fnGetParsFile((unsigned char *)ptrStart, (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
    if (ulValidCheck[0] != ulValid) {
        ulValidCheck[0] = ulValid;
        fnWriteBytesFlash((unsigned char *)ptrStart, (unsigned char *)&ulValidCheck[0], sizeof(ulValidCheck)); // validate data
    }
    if (iBlockUse == 0) {
        fnGetParsFile((unsigned char *)(ptrStart + (PARAMETER_STATUS_SIZE/2)), (unsigned char *)&ulValidCheck, sizeof(ulValidCheck));
        if (ulValidCheck[0] != ulValid) {
            ulValidCheck[0] = ulValid;
            fnWriteBytesFlash((unsigned char *)(ptrStart + (PARAMETER_STATUS_SIZE/2)), (unsigned char *)&ulValidCheck[0], sizeof(ulValidCheck)); // use data
        }
    }
    return 0;
}
#endif
